In [22]:
import pandas as pd

In [23]:
data= pd.read_csv('main2.csv')
data.head(2)

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043

In [24]:
age= data.groupby('occupation')['age'].agg(['max', 'min'])
age.head(5)

               max  min
occupation
administrator   70   21
artist          48   19
doctor          64   28
educator        63   23
engineer        70   22

In [25]:
age.to_csv('output2.csv')